
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		Порядок = ПолучитьСледующийНомерПорядка(); 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСледующийНомерПорядка()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(кпдРазделыДокументов.Порядок) КАК Порядок
	|ИЗ
	|	Справочник.кпдРазделыДокументов КАК кпдРазделыДокументов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 1;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Порядок + 1;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции
