
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.Ссылка КАК Ссылка,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.НомерСтроки КАК НомерСтроки,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ШаблонФайла КАК ШаблонФайла,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ПравилоАвтозаполнения КАК ПравилоАвтозаполнения,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.кпдКонструкторДокумента КАК кпдКонструкторДокумента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ШаблоныВнутреннихДокументов.ПравилаАвтозаполнения КАК ШаблоныВнутреннихДокументовПравилаАвтозаполнения
	|ГДЕ
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.кпдКонструкторДокумента = &Конструктор
	|	И ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ШаблонФайла = &ШаблонФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кпдРазделыДокументовВарианты.Ссылка КАК Раздел,
	|	кпдРазделыДокументовВарианты.Ссылка.Порядок КАК Порядок,
	|	кпдРазделыДокументовВарианты.Ссылка.Наименование КАК Наименование,
	|	кпдРазделыДокументовВарианты.НазваниеВарианта КАК НазваниеВарианта,
	|	кпдРазделыДокументовВарианты.НомерСтроки КАК НомерВарианта,
	|	кпдРазделыДокументовВарианты.ВариантПоУмолчанию КАК ВариантПоУмолчанию,
	|	кпдРазделыДокументовВарианты.Ссылка.Владелец КАК Владелец,
	|	ВТ.ШаблонФайла КАК ШаблонФайла,
	|	ВТ.ПравилоАвтозаполнения КАК ПравилоАвтозаполнения
	|ИЗ
	|	Справочник.кпдРазделыДокументов.Варианты КАК кпдРазделыДокументовВарианты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО кпдРазделыДокументовВарианты.Ссылка.Владелец = ВТ.кпдКонструкторДокумента.Ссылка
	|ГДЕ
	|	кпдРазделыДокументовВарианты.Ссылка.Владелец = &Конструктор
	|	И НЕ кпдРазделыДокументовВарианты.ФайлСсылка.ПометкаУдаления
	|	И НЕ кпдРазделыДокументовВарианты.Ссылка.ПометкаУдаления
	|	И ВТ.ПравилоАвтозаполнения <> ЗНАЧЕНИЕ(Справочник.ПравилаАвтозаполненияФайлов.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерВарианта
	|ИТОГИ ПО
	|	Раздел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("Конструктор", Параметры.Конструктор);
	Запрос.УстановитьПараметр("ШаблонФайла", Параметры.ШаблонОснование);
		
	ВыборкаРаздел = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерРаздела = 1;
	Пока ВыборкаРаздел.Следующий() Цикл
		НаименованиеРаздела = ВыборкаРаздел.Раздел.Наименование;
		//исправить - наимен может содержать пробелы!
		ИмяРаздела = ВыборкаРаздел.Раздел.Наименование;
		
		////Добавляем группировку
		//ЭлементГруппировки = ЭтаФорма.Элементы.Добавить("Группировка"+ Строка(НомерРаздела), Тип("ГруппаФормы"), ЭтаФорма);
		
		//Добавляем реквизит
		Реквизит = Новый РеквизитФормы(ИмяРаздела, Новый ОписаниеТипов("Строка"),, НаименованиеРаздела);
		
		нРеквизиты = Новый Массив;
		нРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(нРеквизиты);
		
		//Добавляем поле ввода
		Элемент = ЭтаФорма.Элементы.Добавить(ИмяРаздела, Тип("ПолеФормы"), ЭтаФорма);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = НаименованиеРаздела;
		
		
		НомерВарианта = 1;
		ВыборкаДетальныеЗаписи = ВыборкаРаздел.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НомерВарианта = 1 Тогда	
				//Добавляем реквизит
				Реквизит = Новый РеквизитФормы(ИмяРаздела + "ВариантыРаздела", Новый ОписаниеТипов("Строка"),, "Варианты раздела");
				нРеквизиты = Новый Массив;
				нРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(нРеквизиты);
				
				//Добавляем поле ввода
				Элемент = ЭтаФорма.Элементы.Добавить(ИмяРаздела + "ВариантыРаздела", Тип("ПолеФормы"), ЭтаФорма);
				Элемент.Вид = ВидПоляФормы.ПолеПереключателя;
				Элемент.ПутьКДанным = ИмяРаздела + "ВариантыРаздела";
				Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				Элемент.КоличествоКолонок = 1;
				
				Элемент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта);
				Если ВыборкаДетальныеЗаписи.ВариантПоУмолчанию Тогда
					ЭтотОбъект.ЭтаФорма[ИмяРаздела + "ВариантыРаздела"] = ВыборкаДетальныеЗаписи.НазваниеВарианта;	
				КонецЕсли;
			Иначе
				Элемент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта);
				Если ВыборкаДетальныеЗаписи.ВариантПоУмолчанию Тогда
					ЭтотОбъект.ЭтаФорма[ИмяРаздела + "ВариантыРаздела"] = ВыборкаДетальныеЗаписи.НазваниеВарианта;	
				КонецЕсли;	
			КонецЕсли;
			
			НомерВарианта = НомерВарианта + 1;
		КонецЦикла;
		НомерРаздела = НомерРаздела + 1;
		
	КонецЦикла;
	
	//Добавляем команду
	Элемент2 = ЭтаФорма.Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), ЭтаФорма);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "Сформировать";
		
	ШаблонОснование = Параметры.ШаблонОснование;
	Элементы.ДекорацияКП.Заголовок = "Конструктор: " + Параметры.Конструктор;
	Элементы.ДекорацияШаблон.Заголовок = "Файл:  " + Параметры.ШаблонОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВариантыРазделов.Очистить();
	
	Для Каждого Элемент из Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
			Раздел = Элемент.Имя;
			
			Для Каждого Элемент из Элементы Цикл
				
				Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
					РезультатПоиска = СтрНайти(Элемент.Имя, Раздел);
					Если РезультатПоиска <> 0 Тогда 
						ИмяРеквизита = Раздел + "ВариантыРаздела"; 
						ЗначениеРеквизита = ЭтотОбъект.ЭтаФорма[ИмяРеквизита];
						Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда 
							НовСтрока = ВариантыРазделов.Добавить();
							НовСтрока.Раздел = Раздел;
							НовСтрока.ВариантРаздела = ЗначениеРеквизита;
							НовСтрока.ШаблонОснование = ШаблонОснование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.Закрыть(ВариантыРазделов);	
	
КонецПроцедуры

